spec/vcr/Spree_Calculator_AvalaraTransaction/_compute/when_given_an_order/when_computing_an_order/should_raise_error.yml

---
http_interactions:
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R737708061","DocDate":"2017-03-20","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"AL","PostalCode":"36104","Country":"US"},{"AddressCode":"Dest","Line1":"A
        Different Road","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #5 - 3654","TaxCode":"PC030000","ItemCode":"SKU-5","Qty":1,"Amount":10.0,"OriginCode":"Orig","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":false}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R737708061","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '796'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Mon, 20 Mar 2017 21:22:57 GMT
      Content-Length:
      - '582'
      Set-Cookie:
      - TS017f1821=01a8ddc44ec89cb03c5cc88113ae9e49d931079bfc29ee2cb9648ce537d40d02be5598604c751395e4cb10872f29f2dbc8e411b2db;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1NZ++enDvwYOdg51Pd/WLp1nLX+zt7D7Y3rm3vbeDL94Ui7xps8Uq/OrN
        3u6jvb1H9x+MP93Zube3v/dT3Lhqs/J4Ua2XLZrvCgR8+LRopuZj9+npu3yx
        aotqGX78JnuXTUpGxgNBn+KTnfG+/9FJVk7XJaE+87/M3j0vlnlDH30vIXrg
        jxcV/fXR7vbzM21hCPHyZOfeDj36cTYpyqK9xjdtvc7x6RPCfJbV18/zy7zE
        Fz9VrO7jiz7+/XECoj+WV4Qr/toZ7+xTr/wZNZKPDPZDo3qat1lR2nGdoKua
        cf3qNZq8yi8Um+Pn+Ps767po3lyvuMfXLQG0n5rh7/D8E+z3RZOhvMgW3Oz4
        +fGT4y+O8Tm1cp+mr98cvzlN3xz/3h/9kuT7Cf4vTY5ns5qY0s2RfkB/fnSc
        Pi3Oz/M6X7bpqyqbAap+bbB+SkyJj090qr6olu1FtciJGPi0S5eXFfFwaV6+
        9+nuDg+hSy7CSz46Y7rv7dzfe/DwIb7hwZr3d3Z3d3bv74IqvyQZhbg/3L2f
        vk6/k03fNtUyfc1I6tfm9S/r4gIf/9zjbiYjIvq/JPl/AMGQJGRIBAAA
    http_version: 
  recorded_at: Mon, 20 Mar 2017 21:22:57 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R737708061","DocDate":"2017-03-20","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"AL","PostalCode":"36104","Country":"US"},{"AddressCode":"Dest","Line1":"A
        Different Road","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"},{"AddressCode":"2","Line1":"1600
        Pennsylvania Ave NW","Line2":null,"City":"Washington","PostalCode":"20500","Country":"US"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #5 - 3654","TaxCode":"PC030000","ItemCode":"SKU-5","Qty":1,"Amount":10.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":false},{"LineNo":"1-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":100.0,"OriginCode":"2","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":false}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R737708061","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1145'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Mon, 20 Mar 2017 21:22:58 GMT
      Content-Length:
      - '672'
      Set-Cookie:
      - TS017f1821=01a8ddc44e7f265f150240fd06a6a18aa473530d5cb42a84ccf843bb528e16bf2438c23f5b3f20cea96093415261c0eb3254a7063f;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1NZ++enDvwYOdg51Pd/WLp1nLX+zt7D7Y3rm3vbeDL94Ui7xps8Uq/OrN
        3u6jvb1H9w/Ge3sPdnYfPvgpbly1WXm8qNbLFs13dwUEPn1aNFPzufv09F2+
        WLVFtQw/fpO9yyYlY+PDoI/x0f543//oJCun65KQn/lfZu+eF8u8oY++lxBF
        8MeLiv76aHf7+Zm2MKR4ebJzb4ce/TibFGXRXuObtl7n+PQJoT7L6uvn+WVe
        4oufKlb38UV/AP2BAqIOhj94Rbjir53xzj71yp9RI/nIYB+Oyn3+NG+zorTj
        OkFXNeP61Ws0eZVfKDbHz/H3d9Z10by5XnGPr1sCaD81w99hDiDY74smQ3mR
        LbjZ8fPjJ8dfHONzauU+TV+/OX5zmr45/r0/+iXJ95NfkowIbX86nr3Sdww+
        z15Rb/Toxz+b08GfbBgoD5N+D2fDfPrDmQvG5yYcGYgj+i2n4vuJNDmezWrS
        EE5c9AOD1VNSAYB2ovPwRbVsL6pFToPFp91xv6xIY5Tm5Xuf7u4wjl1yUMfy
        0RlTdW/n/t6Dhw/xDY/GvL9DKmD3PtGBB62Y4Yvj9Glxfp7X+bJNX1XZjAYF
        3tIW5vU9vGUQ/27WzIvlRUto4NPNiBNC0qdgiY+enuDvDuLcJkCZMNYHXylC
        /MWnOzvpy3y5bK7Ly2xZZOnxZZ6++C6hbuYiooZ/SfL/AIMT1LjUBQAA
    http_version: 
  recorded_at: Mon, 20 Mar 2017 21:22:58 GMT
recorded_with: VCR 3.0.3
